In [155]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

In [156]:
cast = pd.read_csv("cast.csv")
titles = pd.read_csv("titles.csv")
release_date =pd.read_csv("release_dates.csv")

In [157]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [158]:
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [159]:
release_date.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [ ]:
cast_new = pd.DataFrame()
for i in cast["title"] . unique():
    temp = []
    for j in cast[cast["title"] == i]["name"]:
        temp.append(j)
    cast_new={i:temp}

In [ ]:
cast_new

In [15]:
data = pd.merge(release_date,cast,left_on="title",right_on="title")

In [19]:
data.head()

,title,year_x,country,date,year_y,name,type,character,n
0,"#73, Shaanthi Nivaasa",2007,India,2007-06-15,2007,Ramesh Bhat,actor,Kashinath,6.0
1,"#73, Shaanthi Nivaasa",2007,India,2007-06-15,2007,Deepu (III),actor,Arun,8.0
2,"#73, Shaanthi Nivaasa",2007,India,2007-06-15,2007,Master Hirannayya,actor,Kailasanathayya,4.0
3,"#73, Shaanthi Nivaasa",2007,India,2007-06-15,2007,Komal Kumar,actor,Vishwanath aka Gandharva,7.0
4,"#73, Shaanthi Nivaasa",2007,India,2007-06-15,2007,Srinivasa Murthy,actor,Ramanath,5.0

### How many movies are listed in the titles dataframe?

In [20]:
len(titles)

244914

### What are the earliest two films listed in the titles dataframe?

In [21]:
print(titles.sort_values("year").head(2))

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [22]:
len(titles[titles["title"] == "Hamlet"])

20

### How many movies are titled "North by Northwest"?

In [23]:
len(titles[titles["title"] == "North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [34]:
(titles[titles["title"] == "Hamlet"]).sort_values("year")["year"].head(1)

52521    1910
Name: year, dtype: int64

### List all of the "Treasure Island" movies from earliest to most recent.

In [36]:
(titles[titles["title"] == "Treasure Island"])

                  title  year
27076   Treasure Island  1999
37238   Treasure Island  1973
55686   Treasure Island  1918
65051   Treasure Island  1972
77354   Treasure Island  1950
141822  Treasure Island  1934
173051  Treasure Island  1985
196514  Treasure Island  1920

### How many movies were made in the year 1950?

In [ ]:
len()

### How many movies were made in the year 1960?

In [38]:
len(release_date[release_date["year"] == 1960])

3134

### How many movies were made from 1950 through 1959?

In [39]:
len(release_date[(release_date["year"] >= 1950) & (release_date["year"] <= 1959)])

31942

### In what years has a movie titled "Batman" been released?

In [42]:
titles[titles["title"] == "Batman"]["year"].head(1)

39349    1943
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [44]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [46]:
len(cast[cast["title"] == "Inception"]["character"].unique())

56

In [47]:
cast[cast["title"] == "Inception"]["character"].unique()

array(['LAX Passenger', "Fischer's Jet Captain", 'Browning',
       'Mombasan Gambler', 'Bridge Sub Con', 'Miles', 'Elderly Bald Man',
       'Bar Sub Con', 'Snow Commander', 'Cobb', 'Italian Gambler',
       'Stock Broker', 'Extra', 'Cab Driver', 'Penrose Sub Con',
       'Immigration Officer', 'James (3 years)', 'Lobby Sub Con',
       'Old Cobb', 'Arthur', 'Nash', 'Eames', 'Lawyer', 'Pedestrian',
       'Hotel Guest', 'Japanese Landing Crew', 'Mombasan Casino Staff',
       'Thin Man', 'Mombasa Casino Cashier', "Saito's Bodyguard Officer",
       'Street Person', 'Tadashi', 'French Student',
       'Japanese Security Guard', 'Robert Fischer', 'A Passer-By',
       'James (20 months)', "Saito's Attendant", 'Businessman',
       'Maurice Fischer', 'Yusuf', 'Airport Patron', 'Denison',
       "Fischer's Driver", 'Saito', 'Mal', 'Mombasan Cashier',
       'Stockbroker', 'Phillipa (3 years)', 'Phillipa (5 years)',
       'Reporter', 'Flight Attendant', 'Ariadne', 'Private Nurse',
       'Blonde', 'Old Mal'], dtype=object)

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [68]:
a = cast[(cast["title"] == "Inception")]

In [71]:
a["n"].isna().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [73]:
len(a["n"]) - a["n"].isna().sum()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [75]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [84]:
a=cast[cast["title"] == "North by Northwest"][["name","n"]].sort_values("n",ascending =False)
a.dropna(inplace=True)
a

                         name     n
1384780             Ken Lynch  16.0
206471           Edward Binns  15.0
1508344         Patrick McVey  14.0
464736        Philip Coolidge  13.0
2295714          Les Tremayne  12.0
665768      Robert Ellenstein  11.0
1811387          Edward Platt  10.0
2447081         Adam Williams   9.0
1275337         Martin Landau   8.0
1695173           Philip Ober   7.0
3048272  Josephine Hutchinson   6.0
356707         Leo G. Carroll   5.0
3157232   Jessie Royce Landis   4.0
1457165           James Mason   3.0
3518333       Eva Marie Saint   2.0
871426             Cary Grant   1.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [92]:
a=cast[cast["title"] == "Sleuth" ][["name","n","year"]].sort_values("n",ascending =False)
a[a["year"] == 1972]

                       name    n  year
1448690        Teddy Martin  6.0  1972
2724553  Eve (III) Channing  5.0  1972
1465483  John (II) Matthews  4.0  1972
373876       Alec Cawthorne  3.0  1972
326773        Michael Caine  2.0  1972
1705394    Laurence Olivier  1.0  1972

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [93]:
a=cast[cast["title"] == "Sleuth" ][["name","n","year"]].sort_values("n",ascending =False)
a[a["year"] == 2007]

                        name    n  year
1805907        Harold Pinter  3.0  2007
1293634             Jude Law  2.0  2007
326774         Michael Caine  1.0  2007
260242       Kenneth Branagh  NaN  2007
373877   Alec (II) Cawthorne  NaN  2007
2724552    Eve (II) Channing  NaN  2007
3370424    Carmel O'Sullivan  NaN  2007

### How many roles were credited in the silent 1921 version of Hamlet?

In [99]:
a=cast[cast["title"] == "Hamlet" ][["name","n","year","character"]].sort_values("n",ascending =False)
len(a[a["year"] == 1921])
len(a["character"].unique())

112

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [100]:
a=cast[cast["title"] == "Hamlet" ][["name","n","year","character"]].sort_values("n",ascending =False)
len(a[a["year"] == 1996])
len(a["character"].unique())

112

### How many "Hamlet" roles have been listed in all film credits through history?

In [102]:
a=cast[cast["title"] == "Hamlet" ]["character"].unique()

len(a)

112

### How many people have played an "Ophelia"?

In [107]:
a= cast[cast["character"] == "Ophelia"]["name"].unique()
len(a)

115

### How many people have played a role called "The Dude"?

In [106]:
a= cast[cast["character"] == "The Dude"]["name"].unique()
len(a)

19

### How many people have played a role called "The Stranger"?

In [109]:
a= cast[cast["character"] == "The Stranger"]["name"].unique()
len(a)

202

### How many roles has Sidney Poitier played throughout his career?

In [110]:
a= cast[cast["name"] == "Sidney Poitier"]["character"].unique()
len(a)

41

### How many roles has Judi Dench played?

In [111]:
a= cast[cast["name"] == "Judi Dench"]["character"].unique()
len(a)

46

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [123]:
a = cast[cast["name"] == "Cary Grant"][["character", "year","n"]]
a = a[a["year"] == 1940]
a = a[a["n"] == 2]
a

         character  year    n
871423  Nick Arden  1940  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [125]:
a = cast[cast["name"] == "Cary Grant"][["character", "year"]].sort_values("year")
a

                          character  year
871419               Charlie Baxter  1932
871418    Lieutenant B.F. Pinkerton  1932
871392                Nick Townsend  1932
871437                     Ridgeway  1932
871409              Romer Sheffield  1932
...                             ...   ...
871462          Sir William Rutland  1966
871456                      Himself  1981
871397  'Handsome' (in 'Suspicion')  1982
871428                 Walter Burns  1988
871461                      Himself  2015

[79 rows x 2 columns]

### How many roles were available for actors in the 1950s?

In [129]:
len(cast[cast["year"] == 1950]["character"].unique())

15247

In [130]:
cast

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
3786171,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3786172,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3786173,Skammdegi,1985,Dalla ??r?ard?ttir,actress,Hj?krunarkona,9.0
3786174,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3786175,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

### How many roles were available for actresses in the 1950s?

In [135]:
a = cast[cast["year"] == 1950][["character","type"]]
len(a[a["type"] == "actress"])

5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [142]:
a = cast[cast["n"] == 1][["year","character"]]
a = a[a["year"] >= 1980]
len(a["character"].unique())

57697

### How many non-leading roles were available through from the beginning of film history through 1980?

In [143]:
a = cast[cast["n"] != 1][["year","character"]]
a = a[a["year"] >= 1980]
len(a["character"].unique())

1045184

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [154]:
a = cast[cast["year"]>=1980][["year","character","n"]]
a["n"].isna().sum()

1014692